;系统运行参数配置，请勿随意修改，以免造成系统运行异常

;点阵屏（分布式时使用）
[LEDPanel]
;连接方式,0-网口，1-串口
ConnectMode=1
;IP地址
IP=169.254.10.52
;通讯网口
NetPort=9520
;通讯串口
ComPort=5
;波特率
BaudRate=9600
;地址码（新永通：122）
Address=1
;通讯协议（支持协议：NH50R、NH1、NH2、NHSZKS、NHSZLCY、NHXYT、SHTJ、LYCL3000、FOFEN）
Protocol=NHSZKS
;点阵数(16-默认、24、32）
DotNum=16
;空闲显示，“\n”表示换行
IdleDisplay=广州嘉德检测\n欢迎您
;屏号0-3
PanelNum=1

;工位1点阵屏（集中式时使用）
[LEDPanel1]
;连接方式,0-网口，1-串口
ConnectMode=1
;IP地址
IP=169.254.10.52
;通讯网口
NetPort=9520
;通讯串口
ComPort=99
;波特率
BaudRate=9600
;通讯协议（支持协议：NH50R、NH1、NH2、NHSZKS、NHSZLCY）
Protocol=NHSZKS
;点阵数(16-默认、24、32）
DotNum=16
;空闲显示，“\n”表示换行
IdleDisplay=南华仪器

;工位2点阵屏（集中式时使用）
[LEDPanel2]
;连接方式,0-网口，1-串口
ConnectMode=1
;IP地址
IP=169.254.10.52
;通讯网口
NetPort=9520
;通讯串口
ComPort=99
;波特率
BaudRate=9600
;通讯协议（支持协议：NH50R、NH1、NH2、NHSZKS、NHSZLCY）
Protocol=NHSZKS
;点阵数(16-默认、24、32）
DotNum=16
;空闲显示，“\n”表示换行
IdleDisplay=南华仪器

;工位3点阵屏（集中式时使用）
[LEDPanel3]
;连接方式,0-网口，1-串口
ConnectMode=1
;IP地址
IP=169.254.10.52
;通讯网口
NetPort=9520
;通讯串口
ComPort=99
;波特率
BaudRate=9600
;通讯协议（支持协议：NH50R、NH1、NH2、NHSZKS、NHSZLCY）
Protocol=NHSZKS
;点阵数(16-默认、24、32）
DotNum=16
;空闲显示，“\n”表示换行
IdleDisplay=南华仪器

;废气分析仪
[Analyzer]
;通讯串口
ComPort=99
;波特率
BaudRate=9600
;通讯协议
Protocol=503V

;不透光度计
[Opacimeter]
;通讯串口
ComPort=99
;波特率
BaudRate=9600
;通讯协议
Protocol=NHT6

;滤纸式烟度计
[Smokemeter]
;通讯串口
ComPort=99
;波特率
BaudRate=2400
;通讯协议
Protocol=YD

;车速表检验台
[SpeedometerTester]
;通讯串口
ComPort=99
;波特率
BaudRate=38400
;通讯协议
Protocol=NHM10
;是否支持摩托车，0：否，1：是
SupMoto=0
;举升器下降到位最少时间，单位：s，若设置0，则采用下位机到位标志位
LDMinTime=0
;举升器上升到位最少时间，单位：s，若设置0，则采用下位机到位标志位
LUMinTime=0

;前照灯检测仪
[HeadlightTester]
;左灯通讯串口，单灯检测时以左灯配置为准有效
LComPort=6
;左灯波特率
LBaudRate=2400
;左灯通讯协议：NHD6108、QDC1C、FD103
LProtocol=NHD6108
;左靠还是右靠(L:左靠，R:右靠)
LeftOrRight=L
;右灯通讯串口
RComPort=99
;右灯波特率
RBaudRate=2400
;右灯通讯协议
RProtocol=NHD6108
;采用oxyz协议，默认：1，0-否，1-是
UseOXYZPro=1

;侧滑检验台
[SideSlipTester]
;通讯串口
ComPort=2
;波特率
BaudRate=38400
;通讯协议
Protocol=NHS10
;校准点1，单位：m/km
CalibrationPoint1=-5
;校准点2，单位：m/km
CalibrationPoint2=-10
;校准点3，单位：m/km
CalibrationPoint3=5
;校准点4，单位：m/km
CalibrationPoint4=10
;支持检测双轴侧滑，0：否，1：是
SupDetDBSS=0

;轮重仪
[AxleLoadScale]
;通讯串口
ComPort=99
;波特率
BaudRate=38400
;通讯协议
Protocol=NHW10
;校准点1，单位：kg
CalibrationPoint1=1500
;校准点2，单位：kg
CalibrationPoint2=4000
;小量程校准点1，单位：kg
SmallCalibrationPoint1=50
;小量程校准点2，单位：kg
SmallCalibrationPoint2=150
;是否支持摩托车，0：否，1：是
SupMoto=0

;多轴轮重仪
[MulAxleLoadScale]
;通讯串口
ComPort=99
;波特率
BaudRate=38400
;通讯协议
Protocol=NHPZ10
;校准点1，单位：kg
CalibrationPoint1=1500
;校准点2，单位：kg
CalibrationPoint2=4000
;小量程校准点1，单位：kg
SmallCalibrationPoint1=50
;小量程校准点2，单位：kg
SmallCalibrationPoint2=150
;是否支持摩托车，0：否，1：是
SupMoto=0

;滚筒反力式制动检验台
[RollerBrakeTester]
;通讯串口
ComPort=99
;波特率
BaudRate=38400
;通讯协议
Protocol=NHZ10
;制动台有无举升器，0-无，1-有(默认)
IsLiftExistence=1
;举升器下降到位最少时间，单位：s，若设置0，则采用下位机到位标志位
LDMinTime=0
;举升器上升到位最少时间，单位：s，若设置0，则采用下位机到位标志位
LUMinTime=0
;校准点1，单位：daN
CalibrationPoint1=1200
;校准点2，单位：daN
CalibrationPoint2=2400
;校准点3，单位：kg
CalibrationPoint3=1500
;校准点4，单位：kg
CalibrationPoint4=4000
;左前滚筒附着系数
LFAdhesionCoefficient=0.89
;右前滚筒附着系数
RFAdhesionCoefficient=0.89
;左后滚筒附着系数
LRAdhesionCoefficient=0.89
;右后滚筒附着系数
RRAdhesionCoefficient=0.89
;左滚筒附着系数（作废）
LeftAdhesionCoefficient=0.89
;右滚筒附着系数（作废）
RightAdhesionCoefficient=0.89
;是否支持摩托车，0：否，1：是
SupMoto=0
;是否支持轮重,0:否,1:是
SupWL=0
;是否支持升降台体,0:否,1:是
SupUpDownBody=0

;平板式制动检验台
[PlatformBrakeTester]
;通讯串口
ComPort=99
;波特率
BaudRate=38400
;通讯协议
Protocol=NHPZ10
;校准点1，单位：daN
CalibrationPoint1=1200
;校准点2，单位：daN
CalibrationPoint2=2400
;校准点3，单位：kg
CalibrationPoint3=1500
;校准点4，单位：kg
CalibrationPoint4=4000
;左前平板附着系数
LFAdhesionCoefficient=0.89
;右前平板附着系数
RFAdhesionCoefficient=0.89
;左后平板附着系数
LRAdhesionCoefficient=0.89
;右后平板附着系数
RRAdhesionCoefficient=0.89
;是否支持摩托车，0：否，1：是
SupMoto=0

;对射光电开关
[PhotoelectricSwitch]
;通讯串口
ComPort=3
;波特率
BaudRate=38400

;人工条形码扫描仪
[BarcodeScanner]
;通讯串口
ComPort=1
;波特率
BaudRate=9600

;人工数字键盘
[DigitalKeyboard]
;通讯串口
ComPort=99
;波特率
BaudRate=9600

;上线条形码扫描仪
[OLBarcodeScanner]
;通讯串口
ComPort=99
;波特率
BaudRate=9600

;声级计
[SoundLevelMeter]
;通讯串口
ComPort=4
;波特率
BaudRate=9600
;通讯协议
Protocol=HY114

;踏板力手拉力计
[ManipulatingForceTester]
;通讯串口
ComPort=99
;波特率
BaudRate=9600
;通讯协议
Protocol=SG210

;转角台
[SteeringAngleTester]
;通讯串口
ComPort=99
;波特率
BaudRate=38400
;通讯协议
Protocol=NHZJ10

;绝缘仪
[InsulationTester]
;通讯串口
ComPort=99
;波特率
BaudRate=9600
;通讯协议
Protocol=YD9850A

;转速计
[Tachometer]
;通讯串口
ComPort=99
;波特率
BaudRate=9600
;通讯协议
;支持以下协议：NHRPM5300、AVLDS492
Protocol=NHRPM5300

;悬架装置检测台
[SuspensionTester]
;通讯串口
ComPort=99
;波特率
BaudRate=38400
;通讯协议
;支持以下协议：NHXJ
Protocol=NHXJ
;校准点1，单位：kg
CalibrationPoint1=200
;校准点2，单位：kg
CalibrationPoint2=600
;是否有盖板，1-有；0-无
HaveCap=0

;测功机
[Dynamometer]
;通讯端口
ComPort=99
;协议
Protocol=NANHUA
;重型测功机,0:轻型测功机,1:重型测功机
HeavyDyn=0
;举升器下降到位最少时间，单位：s，若设置0，则采用下位机到位标志位
LDMinTime=0
;举升器上升到位最少时间，单位：s，若设置0，则采用下位机到位标志位
LUMinTime=0
;力最大容量,单位:N
MaxForce=6000
;功率最大容量,单位:kW
MaxPower=150
;显示左上PAU1,1:显示,0:不显示,重型测功机时设置有效
TL=1
;显示右上PAU2
TR=1
;显示左下PAU3
BL=1
;显示右下PAU4
BR=1
;加载滑行低速段加载功率,单位:kW
ConstLoadLowerRangePower=6.1
;加载滑行高速段加载功率,单位:kW
ConstLoadHigherRangePower=6.1
;基本惯量小加载力,单位:N
DIWLowerForce=110
;基本惯量大加载力,单位:N
DIWUpperForce=1110
; 基本惯量滑行区间低速点,单位:km/h
DIWLowerVelocity=16
; 基本惯量滑行区间高速点,单位:km/h
DIWUpperVelocity=48
;力校准使用的砝码数量，南华测功机3个，马哈测功机5个
ForceCalWeightCount=3
;力检查砝码对应重量,单位:kg
ForceChkWeight=0,600,1200,1800,2400,3000,3600
;是否有飞轮组,1:有,0:无
FlyWheel=0
;测功机类型,1:2轴4滚筒，2:3轴6滚筒
DynType=1

;轮偏台
[WheelOffsetTester]
;通讯串口
ComPort=99
;波特率
BaudRate=38400
;通讯协议
Protocol=NH
;校准点1，单位：mm
CalibrationPoint1=-5
;校准点2，单位：mm
CalibrationPoint2=-10
;校准点3，单位：mm
CalibrationPoint3=5
;校准点4，单位：mm
CalibrationPoint4=10

;油耗仪
[FuelConMeter]
;通讯串口
ComPort=99
;波特率
BaudRate=9600
;通讯协议
Protocol=

;参数仪
[ParaParams]
;通讯串口
ComPort=99
;波特率
BaudRate=9600
;通讯协议 NHP:南华司机助手仪 DIM:数字式环境参数仪(上海菱生DPH-103)
Protocol=NHP

;摩托车PLC配置
[PLC]
;PLC串口
ComPort=99
;PLC波特率
BaudRate=9600

;地磅
[WeightTester]
;通讯串口
ComPort=99
;波特率
BaudRate=2400
;通讯协议 HengTian:衡天仪表 BengBuBLL:蚌埠宝路来 HuaiNanFH:淮南飞虎 HuaiNanRA:淮南润安 TongChengXR:桐城祥瑞 YaoHua:耀华模式
Protocol=YaoHua

;转向仪配置
[STG]
;通讯串口
ComPort=99
;波特率
BaudRate=9600
;通讯协议
Protocol=SAF01